Revit 2027 API
SymbolTypeId.KipPerFt Property
 Symbol kip/ft, indicating unit Kips per foot.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId KipPerFt { get; }
Public Shared ReadOnly Property KipPerFt As ForgeTypeId
	Get
public:
static property ForgeTypeId^ KipPerFt {
	ForgeTypeId^ get ();
}
static member KipPerFt : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SymbolTypeId Class
Autodesk.Revit.DB Namespace